Ran Plan for dir: `management/global/cost-report` workspace: `default`

<details><summary>Show Output</summary>

```diff
[14:55:07.148] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[14:55:07.156] INFO     ✔ OK                                                    
                                                                                
module.cost_report.data.external.archive_prepare[0]: Reading...
module.cost_report.data.aws_caller_identity.current: Reading...
module.cost_report.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cost_report.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/bb-root-cost-report]
module.cost_report.data.aws_region.current: Reading...
module.cost_report.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
aws_cloudwatch_event_rule.lambda_schedule: Refreshing state... [id=bb-root-cost-report-helper-daily]
module.cost_report.data.aws_partition.current: Reading...
module.cost_report.data.aws_caller_identity.current: Read complete after 0s [id=754065527950]
module.cost_report.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.cost_report.data.aws_partition.current: Read complete after 0s [id=aws]
module.cost_report.aws_iam_role.lambda[0]: Refreshing state... [id=bb-root-cost-report]
module.cost_report.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.cost_report.local_file.archive_plan[0]: Refreshing state... [id=ce6c30b27e569cdb210c9f3962a65c7b3c63b4ea]
module.cost_report.null_resource.archive[0]: Refreshing state... [id=9092462144910318072]
module.cost_report.data.aws_iam_policy_document.logs[0]: Reading...
module.cost_report.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1316491389]
module.cost_report.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=bb-root-cost-report:bb-root-cost-report-0]
module.cost_report.aws_iam_role_policy.logs[0]: Refreshing state... [id=bb-root-cost-report:bb-root-cost-report-logs]
module.cost_report.aws_lambda_function.this[0]: Refreshing state... [id=bb-root-cost-report]
aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowExecutionFromEventBridge]
aws_cloudwatch_event_target.lambda_target: Refreshing state... [id=bb-root-cost-report-helper-daily-SendToLambda]

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

OpenTofu will perform the following actions:

  # module.cost_report.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/d9408de0f464862990fe0c201606f8abf421cf4121908d864c33af1a81655b98.zip" -> "builds/4bd161c449f06b5107cf859bc785b8da8c01e61c924c620ffce4be1d1d2d19f5.zip"
        id                             = "bb-root-cost-report"
      ~ last_modified                  = "2025-07-07T01:43:45.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:754065527950:function:bb-root-cost-report:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:754065527950:function:bb-root-cost-report:3/invocations" -> (known after apply)
        tags                           = {
            "Environment"           = "root"
            "Layer"                 = "cost-report"
            "Terraform"             = "true"
            "terraform-aws-modules" = "lambda"
        }
      ~ version                        = "3" -> (known after apply)
        # (20 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cost_report.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/4bd161c449f06b5107cf859bc785b8da8c01e61c924c620ffce4be1d1d2d19f5.plan.json"
      + id                   = (known after apply)
    }

  # module.cost_report.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9092462144910318072" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/d9408de0f464862990fe0c201606f8abf421cf4121908d864c33af1a81655b98.zip" -> "builds/4bd161c449f06b5107cf859bc785b8da8c01e61c924c620ffce4be1d1d2d19f5.zip"
            # (1 unchanged element hidden)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.



Saved the plan to: default.tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d management/global/cost-report
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.binbash.com.ar:4141/lock?id=binbashar%252Fle-tf-infra-aws%252Fmanagement%252Fglobal%252Fcost-report%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d management/global/cost-report
  ```
Plan: 2 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```